[
  {
    "id": 3820690757277897434,
    "title_uz": "iPhone Fold’ning birinchi norasmiy renderi yangi Apple gadjeti displeyining noodatiy nisbatlarini ochib beradi.",
    "desc_uz": "iPhone Fold’ning birinchi norasmiy renderi yangi Apple gadjeti displeyining noodatiy nisbatlarini ochib beradi.",
    "full_text_uz": "Apple o'zining birinchi katlanadigan smartfoni ustida ishlaganini ham tasdiqlamadi va shuhratparast yangi mahsulot qanday ko'rinishga ega bo'lishi haqida ma'lumot allaqachon onlaynda paydo bo'lgan.\n\niPhone-ticker portali o'z ixtiyorida bo'lgan buklanadigan iPhone-ning SAPR chizmalarini sizdirgan va olingan ma'lumotlarga asoslanib, iPhone Fold/Ultra ning taxminiy renderini yaratish mumkin bo'lgan.\n\nSmartfon, ehtimol, noodatiy tomonlar nisbatiga ega displeylarga ega bo‘ladi: tashqi ekran diagonali 5,49 dyuym, tomonlar nisbati 1,49:1, 2088x1422 o‘lchamlari bilan kichik displey o‘lchami bilan maksimal ma’lumot miqdorini ko‘rsatish imkonini beradi.\n\nIchki ekran diagonali 7,76 dyuym, nisbati 1,43:1 va o'lchamlari 2713 × 1920 bo'ladi.\n\niPhone Fold chizmalari va renderlari smartfon ikkita old kamera olishini tasdiqlaydi.\n\nBundan tashqari, sizdirilgan chizmalardan ma'lum bo'lishicha, Apple smartfonining buklanadigan qismi ochilganda qalinligi Galaxy Z Fold 7 dan 4,8 mm - 0,5 mm ko'proq bo'ladi.\n\nBirinchi buklanadigan iPhone 2026 yilning kuzida 2400 dollar narxda chiqarilishi kutilmoqda.",
    "title_en": "Первый неофициальный рендер iPhone Fold раскрыл необычное соотношение сторон дисплея нового гаджета Apple",
    "desc_en": "Первый неофициальный рендер iPhone Fold раскрыл необычное соотношение сторон дисплея нового гаджета Apple",
    "full_text_en": "Apple еще даже не подтвердила работу над своим первым складным смартфоном, а в сети уже появилась информация о том, как может выглядеть амбициозная новинка.\n\nВ распоряжении портала iPhone-ticker оказались слитые CAD-чертежи складного iPhone и на основании полученной информации удалось создать примерный рендер iPhone Fold/Ultra.\n\nВероятно, смартфон будет отличаться дисплеями с необычным соотношением сторон: внешний экран получит диагональ 5,49\" при соотношении 1,49:1 с разрешением 2088×1422, что позволит выводить максимальное количество информации при небольших размерах дисплея.\n\nВнутренний экран получит диагональ 7,76\" c соотношением 1,43:1 и разрешением 2713×1920.\n\nЧертежи и рендеры iPhone Fold подтверждают, что смартфон получит две фронтальные камеры.\n\nКроме того, из утечки чертежей стало известно, что в разложенном виде толщина складного смартфона Apple составит 4,8 мм — на 0,5 мм больше, чем у Galaxy Z Fold 7.\n\nВыход первого складного iPhone ожидается осенью 2026 года по цене $2400.",
    "image": "https://gagadget.com/media/cache/40/f5/40f507afb1c5fa66de02059aae68e382.webp",
    "article_images": [
      "https://gagadget.com/media/cache/3b/7d/3b7dbe2174ba0ccaec0c3aefacc02333.webp",
      "https://gagadget.com/media/uploads2/iphone-foldabable-mockup-1.jpg",
      "https://gagadget.com/media/uploads2/bbokkpu2mrci.jpg",
      "https://gagadget.com/media/uploads2/kpyparpisguw.jpg",
      "https://gagadget.com/media/uploads2/yrcip3v9fa7s.jpg",
      "https://gagadget.com/media/cache/ab/df/abdfb8dc8e0bdfc0b8d4038e59b9786c.webp",
      "https://gagadget.com/media/cache/8c/9f/8c9f10ffced1792f42f59fea47b9688f.webp",
      "https://gagadget.com/media/cache/fb/3a/fb3aa053ab15931a7cfcf10c5bb14a9b.webp"
    ],
    "category": "Apple",
    "link": "https://gagadget.com/ru/688630-pervyij-neofitsialnyij-render-iphone-fold-raskryil-neobyichnoe-sootnoshenie-storon-displeya-novogo-gadzheta-apple/",
    "time": "вчера, 14:36",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:05:59.606601"
  },
  {
    "id": 3572138776463763344,
    "title_uz": "Insayder yangi premium Signature smartfonlar seriyasini ochadigan Motorola flagmanining yuqori sifatli renderlarini namoyish etdi.",
    "desc_uz": "Insayder yangi premium Signature smartfonlar seriyasini ochadigan Motorola flagmanining yuqori sifatli renderlarini namoyish etdi.",
    "full_text_uz": "Tarmoqda yangi Motorola flagmani haqida qiziqarli ma'lumotlar paydo bo'ldi.\n\nAvvalroq insayder Evan Blass smartfonning xarakteristikalari haqida xabar berib, uning renderlarini ko‘rsatgan bo‘lsa, keyinchalik u Edge 70 Ultra nomi ostida paydo bo‘ldi. Endi Blass o'z ma'lumotlariga aniqlik kiritdi va ma'lum bo'lishicha, Motorolaning rejalari biroz ulug'vorroq.\n\nInsayderning aytishicha, smartfon Motorola Signature deb nomlanadi va yangi premium qurilmalar seriyasini ochadi.\n\nEvan Blass yuqori sifatli renderlarni taqdim etdi va ularga qarab shuni aytishimiz mumkinki, Motorola taniqli dizaynni o'zgartirmaydi va Signature Edge seriyasidan farq qilmaydi. Shuningdek, u uchta kamera blokini oladi, unda periskop moduli paydo bo'ladi. Smartfon egri ekran bilan jihozlanadi.\n\nOldingi renderlarda ko'rsatilganidek, Motorola Signature orqa paneli matoga o'xshash teksturali material bilan bezatilgan, ammo uni taqlid qilish uchun plastik bo'lishi mumkin.\n\nKarbon (chapda) va Martini Olive (o'ngda). https://t.co/cuaisVJeXq pic.twitter.com/pyb9thoLLN\n\nMaʼlumotlardan maʼlum boʻlishicha, Motorola Signature 1,5K OLED displey va 16 Gb tezkor xotiraga ega boʻladi. Chipset uchun Motorola Qualcommning yangi Snapdragon 8 Gen 5 ni tanladi, bu Snapdragon 8 Elite Gen 5 ning pastki versiyasidir.",
    "title_en": "Инсайдер показал качественные рендеры флагмана Motorola, который откроет новую серию премиальных смартфонов Signature",
    "desc_en": "Инсайдер показал качественные рендеры флагмана Motorola, который откроет новую серию премиальных смартфонов Signature",
    "full_text_en": "В сети появилась интересная информация о новом флагмане Motorola.\n\nРанее инсайдер Эван Бласс (Evan Blass) сообщал о характеристиках смартфона и показывал его рендеры, но тогда он фигурировала под названием Edge 70 Ultra. Теперь же Бласс уточнил свои сведения и оказалось, что планы Motorola несколько более амбициозны.\n\nИнсайдер сообщил, что смартфон получит название Motorola Signature и откроет новую серию премиальных устройств.\n\nЭван Блэсс представил качественные рендеры и глядя на них можно констатировать, что Motorola не станет менять узнаваемый дизайн и Signature не будет отличаться от серии Edge. Он тоже получит тройной блок камер, в котором появится перископный модуль. Смартфон оснастят изогнутым экраном.\n\nКак и было показано на предыдущих рендерах, задняя панель Motorola Signature отделана текстурированным материалом, похожим на ткань, но это может быть пластик, имитирующий ее.\n\nIn Carbon (left) and Martini Olive (right). https://t.co/cuaisVJeXq pic.twitter.com/pyb9thoLLN\n\nИз утечек известно, что Motorola Signature получит 1,5K OLED-дисплей и 16 ГБ оперативной памяти. В качестве чипсета Motorola выбрала новый Snapdragon 8 Gen 5 от Qualcomm, который является более бюджетной версией Snapdragon 8 Elite Gen 5.",
    "image": "https://gagadget.com/media/cache/72/de/72deed79cbe191a989abaab0f855dbb8.webp",
    "article_images": [
      "https://gagadget.com/media/cache/5b/43/5b43a0ba164fbf7f9d4dd1a823cf753c.webp",
      "https://gagadget.com/media/uploads2/ih.jpg"
    ],
    "category": "Boshqa",
    "link": "https://gagadget.com/ru/688567-insajder-pokazal-kachestvennyie-renderyi-flagmana-motorola-kotoryij-otkroet-novuyu-seriyu-premialnyih-smartfonov-signature/",
    "time": "вчера, 09:35",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:02.344751"
  },
  {
    "id": 6794180900862893787,
    "title_uz": "OnePlus 15R taqdimoti – 165 Gts chastotali ekran va 7400 mA/soat batareyaga ega kuchli o‘yin sub-flagmani OnePlus Ace 6T ning global versiyasi.",
    "desc_uz": "OnePlus 15R taqdimoti – 165 Gts chastotali ekran va 7400 mA/soat batareyaga ega kuchli o‘yin sub-flagmani OnePlus Ace 6T ning global versiyasi.",
    "full_text_uz": "Xitoyning OnePlus Ace 6T global versiyasiga aylangan OnePlus 15R smartfonining taqdimoti bo‘lib o‘tdi.\n\nOnePlus 15R Xitoydan tashqarida Snapdragon 8 Gen 5 protsessoriga ega bo‘lgan birinchi qurilma bo‘ladi.\n\nYangi mahsulot 6,83 dyuymli AMOLED displeyga ega, yangilanish tezligi 165 Gts, ruxsati 1,5K, piksel zichligi 450 ppi va eng yuqori yorqinligi 1800 nits. Ekran Gorilla Glass 7i bilan himoyalangan, bu esa smartfonning tirnalish va zarbalardan ishonchli himoyalanishini ta’minlaydi. FPS.\n\nSmartfon 5704 mm² maydonga ega bug‘lanish kamerasini, korpusning pastki qismidagi grafit qatlamini va displey ostidagi alohida aerogel qatlamini o‘z ichiga olgan ilg‘or Cryo Velocity sovutish tizimini oldi. Ushbu qaror gadjetning o'yinga qaratilganligini ta'kidlaydi.\n\nOnePlus 15R keng himoya darajalariga ega - IP66, IP68, IP69 va IP69K, bu qimmat modellarda ham kam uchraydi.\n\nKamera blokiga 50 megapikselli Sony IMX906 asosiy sensori, 1/1,56”, f/1,8, optik stabilizatsiya (OIS) va 8 megapikselli keng burchakli ob’ektiv, f/2.2 kiradi.32 megapikselli old kamera videoqo‘ng‘iroqlar paytida yuqori sifatli selfi va foydalanuvchi tasvirlarini taqdim etadi.\n\nOnePlus 15R 80 Vt tez zaryadlashni qo‘llab-quvvatlaydigan 7400 mA/soat batareyaga ega.\n\nYangi mahsulot ikki rangda sotuvga chiqariladi: qora va yashil:\n\n12/256 GB versiyasi uchun narx $700 va 12/512 GB versiyasi uchun $800 bo'ladi. Savdolar yanvar oyining o'rtalarida boshlanadi, ammo Hindistonda OnePlus 15R ni ertaga - 18 dekabrda sotib olish mumkin.",
    "title_en": "Представлен OnePlus 15R — глобальная версия мощного геймерского субфлагмана OnePlus Ace 6T с экраном на 165 Гц и аккумулятором емкостью 7400 мАч",
    "desc_en": "Представлен OnePlus 15R — глобальная версия мощного геймерского субфлагмана OnePlus Ace 6T с экраном на 165 Гц и аккумулятором емкостью 7400 мАч",
    "full_text_en": "Состоялась презентация смартфона OnePlus 15R, который стал глобальной версией китайского OnePlus Ace 6T.\n\nOnePlus 15R станет первым устройством за пределами Китая на базе процессора Snapdragon 8 Gen 5.\n\nНовинка получила 6,83\" AMOLED-дисплей с частотой обновления 165 Гц, разрешением 1,5K, плотностью пикселей 450 ppi и пиковой яркостью 1800 нит. Экран защищен покрытием Gorilla Glass 7i, которое обеспечивает надежную защиту от царапин и ударов. Кроме того, компания подтвердила, что смартфон может запускать игры при 120 FPS.\n\nСмартфон получил передовую систему охлаждения Cryo Velocity, которая включает в себя испарительную камеру площадью 5704 мм², слой графита в нижней части корпуса и отдельный слой аэрогеля под дисплеем. Это решение подчеркивает геймерскую направленность гаджета.\n\nOnePlus 15R имеет большой набор степеней защиты — IP66, IP68, IP69 и IP69K, что редко встречается даже в дорогих моделях.\n\nБлок камер включает основной сенсор Sony IMX906 на 50 Мп, 1/1.56\", f/1.8, с оптической стабилизацией (OIS) и широкоугольный объектив на 8 Мп, f/2.2. Фронтальная камера на 32 Мп обеспечит высокое качество селфи и изображения пользователя во время видеозвонков.\n\nOnePlus 15R оснащен аккумулятором емкостью 7400 мАч с поддержкой быстрой зарядки до 80 Вт.\n\nНовинка поступит в продажу в двух цветах: черном и зеленом:\n\nЦена за версию 12/256 ГБ будет $700 и $800 за версию 12/512 ГБ. Продажи стартуют в середине января, но в Индии OnePlus 15R можно купить уже завтра — 18 декабря.",
    "image": "https://gagadget.com/media/cache/8d/b1/8db1f5a14928f0baba3cc959394725a6.webp",
    "article_images": [
      "https://gagadget.com/media/cache/bf/32/bf32f5e76d5a95e4fc2b33a489b06bc7.webp",
      "https://gagadget.com/media/uploads/7hvlksgqckyr.jpg",
      "https://gagadget.com/media/uploads/hineotjk4ppr.jpg",
      "https://gagadget.com/media/cache/47/86/47862af4d6528730e7dc8a8e1f6bb978.webp",
      "https://gagadget.com/media/cache/60/0e/600e636ab46b4e8fd3b2cd6ceedba0bc.webp"
    ],
    "category": "OnePlus",
    "link": "https://gagadget.com/ru/688500-predstavlen-oneplus-15r-globalnaya-versiya-moschnogo-gejmerskogo-subflagmana-oneplus-ace-6t-s-ekranom-na-165-gts-i-akkumulyatorom-emkostyu-7400-mach/",
    "time": "17 декабря 2025, 18:43",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:05.046630"
  },
  {
    "id": 8554754447686939488,
    "title_uz": "Deyarli o'zgarmagan, lekin kattaroq batareya bilan: Motorola Moto G Power (2026) byudjet smartfonini taqdim etdi.",
    "desc_uz": "Deyarli o'zgarmagan, lekin kattaroq batareya bilan: Motorola Moto G Power (2026) byudjet smartfonini taqdim etdi.",
    "full_text_uz": "Motorola an'anaviy ravishda avtonomiya va amaliylikka e'tibor qaratuvchi o'rta darajadagi smartfon Moto G Power (2026) ni taqdim etdi. Yangi versiyada kompaniya qulay narx va odatiy xususiyatlar muvozanatini saqlab qolgan holda korpusning mustahkamligiga va suv va changdan himoyalanishga e'tiborni kuchaytirdi.\n\nMoto G Power (2026) Full HD+ piksellar soniga ega 6,8 dyuymli LCD displeyga ega, yangilanish tezligi 120 Gts va yorqinligi 1000 nitsgacha. Ekran tirnalish va zarbalardan ishonchli himoya qiluvchi Gorilla Glass 7i qoplamasi bilan himoyalangan. Unumdorlikka MediaTek RAM, komplekt RAM va GB80 mikrosxemasi yordam beradi. 128 GB ichki xotira bulardan uzoqdir yuqori darajadagi texnik xususiyatlar, ammo ular kundalik vazifalarni bajarish uchun etarli.\n\n50 megapikselli asosiy kamera Quad Pixel tizimi va optik stabilizatsiya bilan jihozlangan va 8 MP ultra keng modul va so'l ob'ektiv bilan to'ldiriladi. Old kamera 32 megapikselli ruxsatga ega, bu selfi va videoqo‘ng‘iroqlar sifatini sezilarli darajada yaxshilaydi.\n\nAsosiy e'tibor akkumulyatorga qaratiladi: quvvati 5200 mA/soatgacha oshirildi va TurboPower 30 Vt tez zaryadlash qo'llab-quvvatlanadi.\n\nKorpus IP68/IP69 va MIL‑STD‑810H standartlariga muvofiq sertifikatlangan, bu suv, chang, tomchilardan himoyalanishni kafolatlaydi va ekstremal sharoitlarga bardosh beradi.\n\nSmartfon Android 16 operatsion tizimida ishlaydi, stereodinamiklar bilan jihozlangan va ikkita rangda – Evening Blue va Pure Cashmere ranglarida taqdim etilgan.\n\nMoto G Power (2026) 2026-yil 8-yanvarda sotuvga chiqariladi, dastlab faqat AQShda 299,99 dollarga, Kanadada esa 449,99 SAPRga sotiladi. Keyinchalik global reliz kutilmoqda.",
    "title_en": "Почти без изменений, но с увеличенным аккумулятором: Motorola представила бюджетный смартфон Moto G Power (2026)",
    "desc_en": "Почти без изменений, но с увеличенным аккумулятором: Motorola представила бюджетный смартфон Moto G Power (2026)",
    "full_text_en": "Motorola представила Moto G Power (2026) — смартфон среднего класса, который традиционно делает ставку на автономность и практичность. В новый версии компания усилила акцент на прочность корпуса и защиту от воды и пыли, сохранив доступную цену и привычный баланс характеристик.\n\nMoto G Power (2026) получил 6,8” LCD-дисплей с разрешением Full HD+, частотой обновления 120 Гц и яркостью до 1000 нит. Экран защищен покрытием Gorilla Glass 7i, которое надежно защищает от царапин и ударов. За производительность отвечает чипсет MediaTek Dimensity 6300, дополненный 8 ГБ оперативной и 128 ГБ встроенной памяти. Это далеко не топовые характеристики, но их вполне достаточно для выполнения повседневных задач.\n\nОсновная камера на 50 Мп оснащена системой Quad Pixel и оптической стабилизацией, ее дополняет 8 Мп ультраширокий модуль и макрообъектив. Фронтальная камера получила разрешение 32 Мп, что заметно улучшает качество селфи и видеозвонков.\n\nГлавный акцент сделан на батарее: емкость увеличена до 5200 мА·ч, поддерживается быстрая зарядка TurboPower 30 Вт.\n\nКорпус сертифицирован по стандартам IP68/IP69 и MIL‑STD‑810H, что гарантирует защиту от воды, пыли, падений и выдерживает экстремальные условия.\n\nСмартфон работает под управлением Android 16, оснащен стереодинамиками и выпускается в двух цветах — Evening Blue и Pure Cashmere.\n\nMoto G Power (2026) выйдет 8 января 2026 года сначала только в США по цене $299.99 и в Канаде за CAD 449.99. Позже ожидается и глобальный релиз.",
    "image": "https://gagadget.com/media/cache/d0/4a/d04a5c538dba4e620888d4f42037bbcc.webp",
    "article_images": [
      "https://gagadget.com/media/cache/a4/27/a42717eb52805656a41e6804d764ff80.webp",
      "https://gagadget.com/media/uploads/jnlkn.jpg",
      "https://gagadget.com/media/uploads/kbjk.jpg",
      "https://gagadget.com/media/cache/41/75/417515c377a2ce709b4e01f99747f753.webp",
      "https://gagadget.com/media/cache/a3/3e/a33e72d12e1b287b58e403097e9c8d7a.webp"
    ],
    "category": "Boshqa",
    "link": "https://gagadget.com/ru/688448-pochti-bez-izmenenij-no-s-uvelichennyim-akkumulyatorom-motorola-predstavila-byudzhetnyij-smartfon-moto-g-power-2026/",
    "time": "17 декабря 2025, 12:43",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:07.808965"
  },
  {
    "id": 4883744530115951559,
    "title_uz": "Bu rasmiy: ajoyib chipsetlar va 10 000 mA/soatgacha akkumulyatorli kuchli o‘yin smartfonlari Honor Win seriyasi dekabr oyi oxirida sotuvga chiqariladi.",
    "desc_uz": "Bu rasmiy: ajoyib chipsetlar va 10 000 mA/soatgacha akkumulyatorli kuchli o‘yin smartfonlari Honor Win seriyasi dekabr oyi oxirida sotuvga chiqariladi.",
    "full_text_uz": "Honor mobil o‘yin ishqibozlariga mo‘ljallangan, GT liniyasi o‘rnini bosuvchi Win smartfonlarining yangi seriyasini taqdim etdi.\n\nKompaniya Honor Win taqdimotini “G‘alaba qozonish uchun tug‘ilgan ajoyib kuch” shiori bilan birga olib boradi, bu gadjetlar o‘yin smartfonlariga tegishli ekanligini ta’kidlaydi.\n\nMaʼlumotlardan maʼlum boʻlishicha, xaridorlarga ikkita model – Honor Win va Honor Win Pro taqdim etiladi. Qurilmalar 6,83 dyuymli 1,5K o‘lchamli OLED-displeylar, 50 MP asosiy modulli uch kamerali va 100 Vt tez zaryadlashni qo‘llab-quvvatlaydi. Shu bilan birga, avtonomiyaga e’tibor qaratiladi: Honor Win 8500 mA/soat akkumulyator bilan jihozlangan, Pro-versiyasi esa 010 mAgacha faolroq. kamera bloki yonida qurilgan tizim, bu uzoq o'yin sessiyalarida barqarorlikni oshirishi kerak.\n\nYuqori darajadagi chipsetlar ishlash uchun javobgardir: Honor Winda Snapdragon 8 Elite va Honor Win Proda Snapdragon 8 Elite Gen 5. Qurilmalar dizayni oddiy uslubda metall ramka va porloq orqa panel bilan yaratilgan. Win logotipi korpusda ajralib turadi, bu brend rivojlanishidagi yangi bosqichni anglatadi.\n\nHonor Win va Honor Win Pro’ning narxi oshkor etilmagan, biroq yangi buyumlar Xitoyda dekabr oyi oxirigacha sotuvga chiqishi aytilmoqda, biroq global chiqarilish vaqti noma’lum.",
    "title_en": "Официально: в конце декабря состоится запуск серии мощных геймерских смартфонов Honor Win с крутыми чипсетами и аккумуляторами до 10000 мАч",
    "desc_en": "Официально: в конце декабря состоится запуск серии мощных геймерских смартфонов Honor Win с крутыми чипсетами и аккумуляторами до 10000 мАч",
    "full_text_en": "Honor представила новую серию смартфонов Win, ориентированную на любителей мобильного гейминга, которая заменит линейку GT.\n\nКомпания сопровождает запуск Honor Win слоганом “Исключительная мощь, рожденная побеждать”, что подчеркивает принадлежность гаджетов к геймерским смартфонам.\n\nИз утечек известно, что покупателям предложат две модели - Honor Win и Honor Win Pro. Устройства получат 6,83” OLED‑дисплеи с разрешением 1,5K, тройные камеры с главным модулем на 50 Мп и поддержку 100 Вт быстрой зарядки. При этом акцент сделан на автономность: Honor Win оснащен аккумулятором на 8500 мАч, а версия Pro — до 10 000 мАч. В старшей модели также реализована активная система охлаждения, встроенная рядом с блоком камер, что должно повысить стабильность работы во время длительных игровых сессий.\n\nЗа производительность отвечают топовые чипсеты: Snapdragon 8 Elite в Honor Win и Snapdragon 8 Elite Gen 5 в Honor Win Pro. Дизайн устройств выполнен в строгом стиле с металлической рамкой и глянцевой задней панелью. На корпусе выделяется фирменный логотип Win, символизирующий новый этап развития бренда.\n\nСтоимость Honor Win и Honor Win Pro не раскрывается, но заявлено, что новинки поступят в продажу в Китае до конца декабря, а вот сроки глобального релиза неизвестны.",
    "image": "https://gagadget.com/media/cache/21/f8/21f869371400c5dc5d4a241ca74614b7.webp",
    "article_images": [
      "https://gagadget.com/media/cache/70/39/7039f6242e249de914fb010af9d0f740.webp",
      "https://gagadget.com/media/uploads/honor-win-series-is-launching-this-month.jpg"
    ],
    "category": "Boshqa",
    "link": "https://gagadget.com/ru/688249-ofitsialno-v-kontse-dekabrya-sostoitsya-zapusk-serii-moschnyih-gejmerskih-smartfonov-honor-win-s-krutyimi-chipsetami-i-akkumulyatorami-do-10000-mach/",
    "time": "16 декабря 2025, 12:29",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:10.566600"
  },
  {
    "id": 5310290673121662657,
    "title_uz": "Vivo kompaniyasi Snapdragon 8 Gen 5 protsessori va 50 MP Sony kamerali ixcham flagman S50 Pro mini-ni taqdim etdi.",
    "desc_uz": "Vivo kompaniyasi Snapdragon 8 Gen 5 protsessori va 50 MP Sony kamerali ixcham flagman S50 Pro mini-ni taqdim etdi.",
    "full_text_uz": "Vivo bugun nafaqat arzon Vivo S50 smartfonini, balki flagman darajasidagi xususiyatlarga ega ixcham va foydalanuvchilarga kuchli protsessor, ilg'or kamera va a'lo batareya quvvatini taklif qiluvchi yanada ilg'or S50 Pro mini modelini ham e'lon qildi.\n\nYangi mahsulot 1,5K ruxsat va 120 Gts yangilanish tezligiga ega 6,31 dyuymli OLED displeyga ega, Adreno 829 grafikali Snapdragon 8 Gen 5 chipida ishlaydi, LPDDR5X xotirasi va UFS 4.1 xotirasini qo‘llab-quvvatlaydi.\n\nAsosiy kamera f/1.57 diafragmali 50 megapikselli Sony IMX921 sensorini oldi va optik masshtabli 50 megapikselli Sony IMX882 telefoto linzalari bilan to‘ldirildi. Old kamera ham 50 megapikselli ruxsatga ega.\n\n6500 mA/soat sig‘imli akkumulyator batareyaning uzoq ishlash muddatini ta’minlaydi va 40 Vt tez zaryadlashni qo‘llab-quvvatlaydi. Smartfon korpusi aerokosmik alyuminiy qotishmasidan tayyorlangan va IP69 va MIL‑STD‑810H standartlari bilan himoyalangan.\n\nVivo S50 Pro mini Android 16 asosidagi OriginOS 6 bilan birga keladi.\n\nYangi mahsulot Confession White, Inspirational Purple va Space Black ranglarida taqdim etilgan. Qurilmaning Xitoyda narxi 525 dollardan boshlanadi.",
    "title_en": "Vivo представила компактный флагман S50 Pro mini с процессором Snapdragon 8 Gen 5 и камерой Sony на 50 Мп",
    "desc_en": "Vivo представила компактный флагман S50 Pro mini с процессором Snapdragon 8 Gen 5 и камерой Sony на 50 Мп",
    "full_text_en": "Vivo сегодня анонсировала не только недорогой смартфон Vivo S50, но и более продвинутую модель S50 Pro mini, которая отличается компактными размерами при характеристиках уровня флагмана и предлагает пользователям мощный процессор, продвинутую камеру и отличную автономность.\n\nНовинка получила 6,31” OLED‑дисплей с разрешением 1,5K и частотой обновления 120 Гц, работает на базе чипа Snapdragon 8 Gen 5 с графикой Adreno 829, поддерживает память LPDDR5X и накопитель UFS 4.1.\n\nОсновная камера получила сенсор Sony IMX921 на 50 Мп с диафрагмой f/1.57, дополнена телеобъективом Sony IMX882 на 50 Мп с оптическим зумом. Фронтальная камера также имеет разрешение 50 Мп.\n\nАккумулятор емкостью 6500 мАч обеспечивает длительное время работы и поддерживает быструю зарядку мощностью 40 Вт. Корпус смартфона выполнен из алюминиевого сплава аэрокосмического класса, имеет защиту по стандартам IP69 и MIL‑STD‑810H.\n\nVivo S50 Pro mini поставляется с оболочкой OriginOS 6 на базе Android 16.\n\nНовинка представлена в цветах Confession White, Inspirational Purple и Space Black. Стоимость устройства в Китае стартует с $525.",
    "image": "https://gagadget.com/media/cache/06/ea/06eae794f18f9a150516334390f765cd.webp",
    "article_images": [
      "https://gagadget.com/media/cache/f3/17/f317b1d29cf8899879f2f52943e82c6b.webp"
    ],
    "category": "Boshqa",
    "link": "https://gagadget.com/ru/688137-vivo-predstavila-kompaktnyij-flagman-s50-pro-mini-s-protsessorom-snapdragon-8-gen-5-i-kameroj-sony-na-50-mp/",
    "time": "15 декабря 2025, 21:28",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:13.327271"
  },
  {
    "id": 5424607823115053695,
    "title_uz": "Huawei yangilangan dizayni va kengaytirilgan xotira konfiguratsiyasiga ega Nova 15 seriyali smartfonlarini taqdim etdi",
    "desc_uz": "Huawei yangilangan dizayni va kengaytirilgan xotira konfiguratsiyasiga ega Nova 15 seriyali smartfonlarini taqdim etdi",
    "full_text_uz": "Huawei rasman Nova 15 smartfonlar qatorini e'lon qildi, uning tarkibiga uchta model - Nova 15, Nova 15 Pro va Nova 15 Ultra kiradi. Taqdimot 22 dekabr kuni Xitoyda bo'lib o'tadi va kompaniyaning ichki bozoridagi do'konida oldindan buyurtmalar allaqachon boshlangan.\n\nSeriya sezilarli dizayn o'zgarishlarini oldi. Asosiy Nova 15 oldingi kamerasi va soddalashtirilgan asosiy kamera moduli bilan o'zidan oldingi Nova 14 uslubini saqlab qoladi. Shu bilan birga, Nova 15 Pro va Nova 15 Ultra ikkita halqali yangi gorizontal kamera bloki bilan ajralib turadi, bu chiziqning asosiy vizual aksaniga aylandi. Rasmiy plakatlarga asoslanib, qurilmalarning metall ramkaga ega ekanligini aniqlash mumkin, bu esa yangi mahsulotlarning premium segmentiga tegishli ekanligini ta'kidlaydi.\n\nHar uchala model uchun Huawei to‘rtta rang variantini taklif etadi: Dinamik yashil, Easy Match Purple, Zero Degree White va Phantom Night Black turli xil soya intensivligi.\n\nNova 15 va Nova 15 Pro smartfonlari 12 GB + 256 GB va 12 GB + 512 GB konfiguratsiyalarda taqdim etiladi va Kirin 8020 chipsetini oladi. Nova 15 Ultra, asosiy konfiguratsiyaga qo'shimcha ravishda, 12 GB operativ xotira va 1 TB xotiraga ega versiyani qo'shadi. U Kirin 9010S yoki 9020A protsessorini olishi kutilmoqda.",
    "title_en": "Huawei представила серию смартфонов Nova 15 с обновленным дизайном и расширенными конфигурациями памяти",
    "desc_en": "Huawei представила серию смартфонов Nova 15 с обновленным дизайном и расширенными конфигурациями памяти",
    "full_text_en": "Huawei официально анонсировала линейку смартфонов Nova 15, которая включает три модели — Nova 15, Nova 15 Pro и Nova 15 Ultra. Презентация состоится 22 декабря в Китае, а предзаказы уже стартовали в фирменном магазине компании на родном рынке.\n\nСерия получила заметные изменения в дизайне. Базовый Nova 15 сохранил стиль предшественника Nova 14 с аккуратным вырезом под фронтальную камеру и упрощенным модулем основной камеры. В то же время Nova 15 Pro и Nova 15 Ultra выделяются новым горизонтальным блоком камер с двойным кольцом, что стало главным визуальным акцентом линейки. По официальным постерам можно судить, что устройства получили металлическую рамку, которая подчеркивает, что новинки относятся к премиальному сегменту.\n\nДля всех трех моделей Huawei предлагает четыре цветовых варианта: Dynamic Green, Easy Match Purple, Zero Degree White и Phantom Night Black с разной интенсивностью оттенков.\n\nСмартфоны Nova 15 и Nova 15 Pro будут доступны в конфигурациях 12 ГБ + 256 ГБ и 12 ГБ + 512 ГБ и получат чипсет Kirin 8020. В Nova 15 Ultra, помимо базовой конфигурации, добавят версию с 12 ГБ оперативной памяти и хранилищем на 1 ТБ. Ожидается, что она получит процессор Kirin 9010S или 9020A.",
    "image": "https://gagadget.com/media/cache/66/e3/66e32724aa80f11624cf08b73c18eddd.webp",
    "article_images": [
      "https://gagadget.com/media/cache/88/f0/88f0b335e13cf191e698b1906178c2b4.webp",
      "https://gagadget.com/media/uploads/huawei-nova-15.jpg",
      "https://gagadget.com/media/uploads/huawei-nova-15-pro.jpg",
      "https://gagadget.com/media/uploads/huawei-nova-15-ultra.jpg"
    ],
    "category": "Boshqa",
    "link": "https://gagadget.com/ru/688064-huawei-predstavila-seriyu-smartfonov-nova-15-s-obnovlennyim-dizajnom-i-rasshirennyimi-konfiguratsiyami-pamyati/",
    "time": "15 декабря 2025, 13:34",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:16.091585"
  },
  {
    "id": 7661734677862781142,
    "title_uz": "Insayder Apple kompaniyasining buklanadigan iPhone’da Face ID’dan foydalanishdan bosh tortishi sabablarini tushuntirib berdi va uning ilgagining yuqori mustahkamligini qayd etdi.",
    "desc_uz": "Insayder Apple kompaniyasining buklanadigan iPhone’da Face ID’dan foydalanishdan bosh tortishi sabablarini tushuntirib berdi va uning ilgagining yuqori mustahkamligini qayd etdi.",
    "full_text_uz": "Ko‘plab sizdirilgan ma’lumotlardan ma’lum bo‘lishicha, birinchi buklanadigan iPhone Face ID texnologiyasini olmaydi va egasini yon tomondagi Touch ID barmoq izi skaneri yordamida taniydi.\n\nInsider Digital Chat Station bu ma'lumotni yana bir bor tasdiqladi va Apple tomonidan bu qarorning sabablarini tushuntirdi.\n\nDigital Chat Station xabariga ko‘ra, yuzni 3D skanerlash apparati smartfon ichki maydonining katta qismini egallaydi va Apple iPhone Fold’ni iloji boricha yupqaroq qilishga intilayotgani sababli, u displey yuzasi ostida yashiringan 3D ultratovushli barmoq izi skaneri bilan bir qatorda bu imkoniyatdan ham voz kechadi.\n\nMa'lumot beruvchi Apple eng samarali dizaynni yaratish uchun katta sa'y-harakatlarni amalga oshirayotganini tasdiqladi va juda suyuq metall menteşani \"juda bardoshli\" deb ataydi.\n\nBloomberg jurnalisti Mark Gurman avvalroq iPhone Fold \"bir-biriga ulangan ikkita ultra yupqa iPhone Air\"ga o'xshab ko'rinishini, u juda nozik bo'lishi bilan birga, ixchamligi bo'yicha boshqa ishlab chiqaruvchilarning qurilmalaridan past bo'lishini xabar qilgan edi.\n\nMish-mishlarga ko'ra, buklanadigan gadjetning ichki ekranining diagonali 7,8 dyuymni, tashqisi esa 5,5 dyuymni tashkil qiladi. Katlanganda qurilma qalinligi 9 dan 9,5 mm gacha, ochilganda esa 4,5 dan 4,8 mm gacha bo'ladi.\n\nBuklanadigan iPhone titan qotishma korpusga, 48 megapikselli datchiklarga ega ikkita orqa kameraga va bitta old kameraga ega bo'ladi.\n\niPhone Fold haqidagi so'nggi yangiliklar shundaki, u brend tarixidagi eng katta batareyaga ega bo'ladi. Insayder yeux11 ma’lumotlariga ko‘ra, Amerika kompaniyasi hozirda 5400-5800 mA/soat sig‘imli akkumulyatorlarni sinovdan o‘tkazmoqda va katta ehtimol bilan kattaroq variantga ustunlik beradi.",
    "title_en": "Инсайдер пояснил причины отказа Apple от Face ID в складном iPhone и отметил высокую прочность его шарнира",
    "desc_en": "Инсайдер пояснил причины отказа Apple от Face ID в складном iPhone и отметил высокую прочность его шарнира",
    "full_text_en": "Из многочисленных утечек известно, что первый складной iPhone не получит технологию Face ID и будет распознавать владельца с помощью бокового сканера отпечатков пальцев Touch ID.\n\nИнсайдер Digital Chat Station еще раз подтвердил эту информацию и пояснил причины данного решения Apple.\n\nКак сообщил Digital Chat Station, аппаратное обеспечение для 3D-сканирования лица занимает значительную часть внутреннего пространства смартфона, а поскольку Apple стремится сделать iPhone Fold (название условное) как можно тоньше, она откажется от этой опции, как и от 3D-ультразвукового сканера отпечатков пальцев, скрытого под поверхностью дисплея.\n\nИнформатор подтвердил, что Apple прикладывает большие усилия для создания максимально эффективной конструкции и тот самый шарнир из жидкого металла называет “очень прочным”.\n\nЖурналист Bloomberg Марк Гурман (Mark Gurman) ранее сообщал, что iPhone Fold будет выглядеть, как “два ультратонких iPhone Air, соединенные вместе”, при этом он будет достаточно тонким, но в плане компактности уступит устройствам других производителей.\n\nПо слухам, диагональ внутреннего экрана складного гаджета составит 7,8″, а внешнего – 5,5″. В сложенном состоянии толщина устройства будет от 9 до 9,5 мм, а в раскрытом — от 4,5 до 4,8 мм.\n\nСкладной ‌iPhone‌ получит корпус из титанового сплава, двойную заднюю камеру с сенсорами на 48 Мп и одинарную фронтальную.\n\nИз свежих новостей о iPhone Fold — это то, что он получит самый вместительный аккумулятор в истории бренда. Согласно данным инсайдера yeux11, в данный момент американская компания тестирует батареи емкостью 5400-5800 мАч, и скорее всего отдаст предпочтение большему варианту.",
    "image": "https://gagadget.com/media/cache/85/72/857204d3c7f22e303cc680a127988bc9.webp",
    "article_images": [
      "https://gagadget.com/media/cache/f1/76/f176092c1226ce66773c6bb8067918ab.webp",
      "https://gagadget.com/media/uploads/apple-.jpg"
    ],
    "category": "Apple",
    "link": "https://gagadget.com/ru/688057-insajder-poyasnil-prichinyi-otkaza-apple-ot-face-id-v-skladnom-iphone-i-otmetil-vyisokuyu-prochnost-ego-sharnira/",
    "time": "15 декабря 2025, 13:07",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:18.840485"
  },
  {
    "id": 6525061888162861607,
    "title_uz": "Bu rasmiy: 200 MP asosiy sensorli va 7000 mA/soat akkumulyatorli zamonaviy Realme 16 Pro smartfonlari yanvar oyi boshida debyut qiladi.",
    "desc_uz": "Bu rasmiy: 200 MP asosiy sensorli va 7000 mA/soat akkumulyatorli zamonaviy Realme 16 Pro smartfonlari yanvar oyi boshida debyut qiladi.",
    "full_text_uz": "Realme yangi Realme 16 Pro foto flagmanlari seriyasi haqidagi birinchi ma’lumot bilan bo‘lishdi.\n\nRealme 16 Pro va Realme 16 Pro+ ning global premyerasi 2026-yil 6-yanvar kuni Hindistonda bo‘lib o‘tadi, u yerda smartfonlar sotuvi faqat Flipkart onlayn platformasida tashkil etiladi.\n\nXitoy brendi mashhur sanoat dizayneri Naoto Fukasava smartfonlar dizayni ustida ishlagani haqida tizerlarni chop etdi.\n\nYangi mahsulot mat qoplamali ikki rangli orqa panel va gorizontal yo‘nalishda ishlangan yaltiroq kamera blokiga ega bo‘ladi.\n\nRealme 16 Pro seriyasi bir nechta rang variantlarida keladi, jumladan Camellia Pushti, Orchid Purple, Master Gold va Pebble Grey.\n\nInsayder maʼlumotlariga koʻra, Realme 16 Pro+ nomsiz Snapdragon chipsetini, 80 Vt tez zaryadlashni qoʻllab-quvvatlaydigan 7000 mA/soat akkumulyatorni, shuningdek, 1,5K oʻlchamli 6,78 dyuymli AMOLED ekranni, 144 Gts chastotali yangilanish va 50 MP asosiy kamerani oladi va asosiy kamera old moduli20 boʻladi. MP sensori, 8 MP va periskop uchun ultra keng burchakli kamera telefoto linzalari.",
    "title_en": "Официально: в начале января дебютируют стильные смартфоны Realme 16 Pro с 200 Мп основным сенсором и аккумулятором на 7000 мА·ч",
    "desc_en": "Официально: в начале января дебютируют стильные смартфоны Realme 16 Pro с 200 Мп основным сенсором и аккумулятором на 7000 мА·ч",
    "full_text_en": "Realme поделилась первой информацией о новой серии фотофлагманов Realme 16 Pro.\n\nГлобальная премьера Realme 16 Pro и Realme 16 Pro+ состоится 6 января 2026 года в Индии, где продажи смартфонов будут эксклюзивно организованы на онлайн-платформе Flipkart.\n\nКитайский бренд опубликовал тизеры, которые сообщили, что над дизайном смартфонов работал известный промышленный дизайнер Наото Фукасавa (Naoto Fukasawa).\n\nНовинка получит двухцветную заднюю панель с матовым покрытием и глянцевым блоком камер, который выполнен в горизонтальной ориентации.\n\nСерия Realme 16 Pro будет представлена ​​в нескольких цветовых вариантах, включая Camellia Pink, Orchid Purple, Master Gold и Pebble Gray.\n\nПо инсайдерской информации, Realme 16 Pro+ получит неназванный чипсет Snapdragon, аккумулятор емкостью 7000 мА·ч с поддержкой 80 Вт быстрой зарядки, а также 6,78” AMOLED-экран с разрешением 1,5K, частотой обновления 144 Гц и 50 Мп фронтальной камерой. Основная камера будет тройной и главный модуль получит 200 Мп сенсор, сверхширокоугольную камеру на 8 Мп и перископный телеобъектив.",
    "image": "https://gagadget.com/media/cache/0f/d4/0fd4d454eac68f6ba987ed6adb0b7edc.webp",
    "article_images": [
      "https://gagadget.com/media/cache/82/56/8256db507f378f72b0c3e1d9255bbf62.webp",
      "https://gagadget.com/media/uploads/realme-16-pro-colors-1.jpg"
    ],
    "category": "Boshqa",
    "link": "https://gagadget.com/ru/688043-ofitsialno-v-nachale-yanvarya-debyutiruyut-stilnyie-smartfonyi-realme-16-pro-s-200-mp-osnovnyim-sensorom-i-akkumulyatorom-na-7000-mach/",
    "time": "15 декабря 2025, 11:48",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:21.626450"
  },
  {
    "id": 9220583224346996643,
    "title_uz": "Dekabr oyi oxirida bo'lib o'tadigan katta taqdimotda Xiaomi Xiaomi 17 Ultra foto flagmani, bir nechta o'rta sinf smartfonlari, mustaqil aqlli soatlar va planshetni taqdim etadi.",
    "desc_uz": "Dekabr oyi oxirida bo'lib o'tadigan katta taqdimotda Xiaomi Xiaomi 17 Ultra foto flagmani, bir nechta o'rta sinf smartfonlari, mustaqil aqlli soatlar va planshetni taqdim etadi.",
    "full_text_uz": "26-dekabr kuni Xiaomi keng ko‘lamli taqdimotini o‘tkazishi kutilmoqda, uning davomida u Xiaomi 17 Ultra foto flagmanini e’lon qiladi va Xiaomi 17 bazasining global sotuvga chiqarilishini e’lon qiladi.\n\nAmmo bu Xitoy kompaniyasi uchun katta voqeaning faqat bir qismi.\n\nBiz allaqachon Xiaomi kompaniyasi Apple-ga qarshi kurashishga tayyorlanayotgani va AirTag’ga o‘xshash ixcham trekerni chiqarishi haqida xabar bergan edik.\n\nEndi nufuzli insayder Digital Chat Station maʼlumotni toʻldirdi va ommaga mahsulotlar qatori, jumladan, ilgʻor kameraga ega Snapdragon 8 Elite Gen 5 chipseti asosidagi flagman smartfoni (shubhasiz, biz Xiaomi 17 Ultra haqida gapiryapmiz), shuningdek Dimensity 89 va Dimensity 89 seriyali oʻrta toifadagi bir nechta modellarni taqdim etishini aytdi.\n\nBundan tashqari, Xiaomi smartfonga ulanmasdan ham ishlay oladigan, lekin eSIM-ni qo'llab-quvvatlaydigan yangi aqlli soatlarni chiqaradi va ta'sirchan 900 mA/soat akkumulyatorga, simsiz minigarnituralarning ikkita modeli va o'rta diapazonli planshetga, shuningdek, aqlli uy ekotizimiga mo'ljallangan bir qator yangi qurilmalarga ega bo'ladi - birorta ham Xiaomi taqdimoti bu holda amalga oshmaydi.",
    "title_en": "На большой презентации в конце декабря Xiaomi представит фотофлагман Xiaomi 17 Ultra, несколько смартфонов среднего класса, автономные смарт-часы и планшет",
    "desc_en": "На большой презентации в конце декабря Xiaomi представит фотофлагман Xiaomi 17 Ultra, несколько смартфонов среднего класса, автономные смарт-часы и планшет",
    "full_text_en": "Ожидается, что 26 декабря Xiaomi проведет масштабную презентацию, в рамках которой анонсирует фотофлагман Xiaomi 17 Ultra и объявит о глобальном запуске базовой модели Xiaomi 17.\n\nНо это лишь часть большого ивента китайской компании.\n\nМы уже сообщали, что Xiaomi готовится бросить вызов Apple и выпустит компактный трекер, аналогичный AirTag.\n\nТеперь же авторитетный инсайдер Digital Chat Station дополнил информацию и сообщил, что публике представят линейку продуктов, включая флагманский смартфон на чипсете Snapdragon 8 Elite Gen 5 с продвинутой камерой (очевидно, речь о Xiaomi 17 Ultra), а также пару моделей среднего класса на процессорах серии Dimensity 8 и Dimensity 9.\n\nКроме того, Xiaomi выпустит новые смарт-часы, которые смогут работать без привязки к смартфону, но с поддержкой eSIM и получат впечатляющий аккумулятор на 900 мАч, две модели беспроводных наушников и планшет среднего класса, а также ряд новых устройств для экосистемы умного дома — без этого уже не обходится ни одна презентация Xiaomi.",
    "image": "https://gagadget.com/media/cache/2d/03/2d03cdf8196300e38634f9b244dde9be.webp",
    "article_images": [
      "https://gagadget.com/media/cache/71/62/7162c68a0b1b8edab4139bee9f3b1d88.webp"
    ],
    "category": "Xiaomi",
    "link": "https://gagadget.com/ru/687976-na-bolshoj-prezentatsii-v-kontse-dekabrya-xiaomi-predstavit-fotoflagman-xiaomi-17-ultra-neskolko-smartfonov-srednego-klassa-avtonomnyie-smart-chasyi-i-planshet/",
    "time": "14 декабря 2025, 12:56",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:24.367688"
  },
  {
    "id": 3545402985854703898,
    "title_uz": "Ehtiyot bo'ling: Galaxy Z TriFold ichki displeyini ta'mirlash 1000 dollardan oshadi.",
    "desc_uz": "Ehtiyot bo'ling: Galaxy Z TriFold ichki displeyini ta'mirlash 1000 dollardan oshadi.",
    "full_text_uz": "Kecha – 12 dekabr – Janubiy Koreyada buklanadigan Galaxy Z TriFold smartfoni sotuvi boshlandi. 2400 dollarlik katta narxga qaramay, Samsung’ning yangi mahsuloti uchun katta navbatlar paydo bo‘ldi va gadjetning birinchi partiyasi bir zumda sotilib ketdi.\n\nKoreyalik ishlab chiqaruvchi trifoldni ta'mirlash narxini e'lon qildi va bu raqamlar smartfondan o'ta ehtiyotkorlik bilan foydalanish kerakligini ko'rsatadi.\n\nSamsung kompaniyasi Koreyada Galaxy Z TriFold’ning ichki displeyini almashtirish 1120 dollarga (vonga ko‘ra) tushishini e’lon qildi, bu kompaniya tarixidagi eng qimmat displey bo‘lib, bu narxga yangi Galaxy S25 Ultra’ni sotib olishingiz mumkinligi haqidagi oddiy haqiqatni ta’kidladi.\n\nAmmo tashqi ekranni almashtirish juda kulgili turadi - atigi 92 dollar.\n\nMijozlarning zarbasini kamaytirish uchun Samsung ichki ekranni bir marta yarim narxga almashtirishga rozi bo'ladi, lekin u baribir 500 dollardan oshadi va bunday pulga siz o'rta byudjetli ajoyib smartfon sotib olishingiz mumkin - bu matematika.\n\nAmmo xolis bo‘laylik, avvalroq Samsung trifoldni yig‘ish jarayoni, uni sinovdan o‘tkazish va sifat nazorati qanday amalga oshirilayotganini ko‘rsatgan va bu kadrlar yig‘ma gadjetga zarar yetkazish oson bo‘lmasligiga ishonch hosil qilish imkonini beradi.",
    "title_en": "Будьте аккуратны: ремонт внутреннего дисплея Galaxy Z TriFold обойдется более $1000",
    "desc_en": "Будьте аккуратны: ремонт внутреннего дисплея Galaxy Z TriFold обойдется более $1000",
    "full_text_en": "Вчера — 12 декабря — в Южной Корее стартовали продажи складного смартфона Galaxy Z TriFold. Несмотря на солидную цену в $2400 за новинкой от Samsung выстроились огромные очереди и первую партию гаджета мгновенно раскупили.\n\nКорейский производитель озвучил стоимость ремонта трифолда и эти цифры говорят о том, смартфоном следует пользоваться крайне аккуратно.\n\nSamsung сообщила, что замена внутреннего дисплея Galaxy Z TriFold в Корее обойдется в $1120 (в пересчете с вон) - это самый дорогой дисплей в истории компании, что красноречиво подчеркивает простой факт: по такой цене можно приобрести новый Galaxy S25 Ultra.\n\nА вот замена внешнего экрана стоит смешно — всего $92.\n\nЧтобы уменьшить шок покупателей, Samsung согласна один раз заменить внутренний экран за полцены, но это все равно будет более $500, а за такие деньги можно купить отличный среднебюджетный смартфон — вот такая арифметика.\n\nНо будем объективны, ранее Samsung показала, как происходит процесс сборки трифолда, его тестирования и контроль качества, и эти кадры позволяют быть уверенными, что повредить складной гаджет будет непросто.",
    "image": "https://gagadget.com/media/cache/28/72/2872f82832eb1d1f3e8d52e625168219.webp",
    "article_images": [
      "https://gagadget.com/media/cache/f7/06/f706d12733d3844b40bf37bb5d7e9e3b.webp"
    ],
    "category": "Samsung",
    "link": "https://gagadget.com/ru/687882-budte-akkuratnyi-remont-vnutrennego-displeya-galaxy-z-trifold-obojdetsya-bolee-1000/",
    "time": "13 декабря 2025, 13:01",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:30.523141"
  },
  {
    "id": 1232521138380119590,
    "title_uz": "iPhone 17 Pro qo‘shimcha displeyga ega bo‘ladi: Selfix korpusi Apple smartfonini Xiaomi 17 Pro’ga o‘xshatadi.",
    "desc_uz": "iPhone 17 Pro qo‘shimcha displeyga ega bo‘ladi: Selfix korpusi Apple smartfonini Xiaomi 17 Pro’ga o‘xshatadi.",
    "full_text_uz": "Apple hali Xiaomi 17 Pro/Pro Max kabi qo‘shimcha orqa displeyli iPhone’ni chiqarishni rejalashtirmayapti, biroq xitoylik ishlab chiqaruvchining g‘oyasi shu qadar muvaffaqiyatli bo‘ldiki, boshqa kompaniyalar buni takrorlamaslikka yordam bera olmadilar.\n\nAksessuarlar ishlab chiqaruvchi Dockcase iPhone 17 Pro uchun smartfonning orqa tomoniga ikkinchi displey qo‘shadigan noyob Selfix g‘ilofini taqdim etdi.\n\nSelfix korpusi 480 x 480 pikselli dumaloq 1,6 dyuymli AMOLED sensorli displey bilan jihozlangan. Ekran alohida dasturni o‘rnatishni talab qilmaydi va kechiktirmasdan ishlaydi. Aksessuar o‘zining quvvat tugmasi bilan jihozlangan, zaryadlash uchun esa 100 Vt quvvatga ega PD 3.0 ni qo‘llab-quvvatlaydigan USB-C porti taqdim etilgan.\n\nShunisi e'tiborga loyiqki, Selfix korpusi 2 TB gacha bo'lgan microSD uchun individual slotga ega bo'lgan va kartadan unga yuklangan fotosuratlar va videolar standart iPhone galereyasida mavjud.\n\nNarxlari va chiqarilish sanasi hali e'lon qilinmagan, ammo loyiha tez orada Kickstarterda ishga tushadi. Mijozlarga Selfix bir nechta ranglarda taklif etiladi: Midnight Black, Oat White va Blush Pushti.\n\nAvvalo, Dockcase Selfix iPhone 17 Pro’ning old kamerasidan emas, balki ancha kuchliroq asosiy modul yordamida yuqori sifatli selfi va videobloglar suratga olishga yordam beradi.",
    "title_en": "У iPhone 17 Pro появится дополнительный дисплей: чехол Selfix сделает смартфон Apple похожим на Xiaomi 17 Pro",
    "desc_en": "У iPhone 17 Pro появится дополнительный дисплей: чехол Selfix сделает смартфон Apple похожим на Xiaomi 17 Pro",
    "full_text_en": "Apple пока не планирует выпускать iPhone с дополнительным задним дисплеем, как у Xiaomi 17 Pro/Pro Max, однако идея китайского производителя оказалась настолько удачной, что ее не могли не повторить другие компании.\n\nПроизводитель аксессуаров Dockcase представил уникальный чехол Selfix для iPhone 17 Pro, который добавляет на заднюю панель смартфона второй дисплей.\n\nЧехол Selfix оснащен круглым 1,6” сенсорным AMOLED-дисплеем с разрешением 480 х 480 пикселей. Экран не требует установки отдельного приложения и работает без задержек. Аксессуар оснащен собственной кнопкой питания, а для его зарядки предусмотрен порт USB-C с поддержкой PD 3.0 мощностью до 100 Вт.\n\nПримечательно, что чехол Selfix получил индивидуальный слот для microSD объемом до 2 ТБ, причем загруженные на него фото и видео с карты доступны в стандартной галерее iPhone.\n\nСтоимость и дата выхода пока не объявлены, но проект скоро будет запущен на Kickstarter. Покупателям предложат Selfix в нескольких цветах: Midnight Black, Oat White и Blush Pink.\n\nПрежде всего Dockcase Selfix поможет делать качественные селфи и снимать видеоблоги, используя не фронтальную камеру iPhone 17 Pro, а гораздо более мощный основной модуль.",
    "image": "https://gagadget.com/media/cache/eb/b4/ebb4301669334e2dee750c3bb6444456.webp",
    "article_images": [
      "https://gagadget.com/media/cache/2d/2d/2d2db82199fe2f22526adefb9fb90fc1.webp",
      "https://gagadget.com/media/uploads/hikj.jpg"
    ],
    "category": "Apple",
    "link": "https://gagadget.com/ru/687875-u-iphone-17-pro-poyavitsya-dopolnitelnyij-displej-chehol-selfix-sdelaet-smartfon-apple-pohozhim-na-xiaomi-17-pro/",
    "time": "13 декабря 2025, 12:30",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:36.183060"
  },
  {
    "id": 1446965841404249788,
    "title_uz": "Nega pushti emas? Birinchi oqish Nothing Phone (4a) byudjetli smartfonlarining kutilmagan ranglarini va bir qator xususiyatlarni ochib berdi.",
    "desc_uz": "Nega pushti emas? Birinchi oqish Nothing Phone (4a) byudjetli smartfonlarining kutilmagan ranglarini va bir qator xususiyatlarni ochib berdi.",
    "full_text_uz": "Tarmoqda 2026-yil bahorida chiqarilishi kutilayotgan Nothing Phone (4a) va (4a) Pro byudjet smartfonlari haqidagi ilk maʼlumotlar paydo boʻldi. MlgmXyysd_bibilailai taxallusi ostidagi insayder ba'zi texnik tafsilotlarni, yangi mahsulotlarning narxini va Britaniya brendining kutilmagan dizayn qarorini oshkor qildi.\n\nMlgmXyysd_bibilailai ma'lumotlariga ko'ra, smartfonlar Snapdragon 7s seriyali chipset, e-Sim-ni qo'llab-quvvatlaydi va faqat 12+256 GB xotira konfiguratsiyasida mavjud bo'ladi.\n\nSmartfonlar Phone (3a) va (3a) Pro-ga nisbatan taxminan 100 dollarga biroz qimmatlashishi kutilmoqda:\n\nXaridorlarga to'rtta rang taklif etiladi va standart qora va oq rangga kutilmagan variantlar qo'shiladi: ko'k va ... pushti.\n\nInsayderning qo‘shimcha qilishicha, Nothing to‘liq o‘lchamli arzon naushniklar (a) ham chiqarilmaydi, bu esa Headphone (1) ning arzonroq versiyasiga aylanadi va ularda ranglarning qiziqarli tanlovi ham bo‘ladi: bir xil pushti, sariq, qora va oq.",
    "title_en": "Почему бы и не розовый? Первая утечка раскрыла неожиданные цвета бюджетных смартфонов Nothing Phone (4a) и ряд характеристик",
    "desc_en": "Почему бы и не розовый? Первая утечка раскрыла неожиданные цвета бюджетных смартфонов Nothing Phone (4a) и ряд характеристик",
    "full_text_en": "В сети появилась первая информация о бюджетных смартфонах Nothing Phone (4a) и (4a) Pro, выход которых ожидается весной 2026 года. Инсайдер под ником MlgmXyysd_bibilailai раскрыл немного технических подробностей, стоимость новинок и неожиданное дизайнерское решение британского бренда.\n\nПо информации MlgmXyysd_bibilailai, смартфоны получат чипсет серии Snapdragon 7s, поддержку e-Sim и будут доступны только в конфигурации памяти 12+256 Гб.\n\nОжидается, что смартфоны немного подорожают, примерно на $100 по сравнению с Phone (3a) и (3a) Pro:\n\nПокупателям предложат четыре цвета и к стандартному черному и белому добавят неожиданные варианты: голубой и … розовый.\n\nИнсайдер добавил, что к бюджетным смартфонам Nothing выпустит и недорогие полноразмерные наушники Headphone (a), которые станут более доступной версией Headphone (1), и они тоже получат интересный выбор цветов: тот же розовый, желтый, черный и белый.",
    "image": "https://gagadget.com/media/cache/9b/d3/9bd341f7aa76a6cf0743918a910cfae5.webp",
    "article_images": [
      "https://gagadget.com/media/cache/9d/52/9d52d39200525dcf412c1fa5f3e123b3.webp"
    ],
    "category": "Boshqa",
    "link": "https://gagadget.com/ru/687510-pochemu-byi-i-ne-rozovyij-pervaya-utechka-raskryila-neozhidannyie-tsveta-byudzhetnyih-smartfonov-nothing-phone-4a-i-ryad-harakteristik/",
    "time": "11 декабря 2025, 18:56",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:42.416510"
  },
  {
    "id": 1561974821173010426,
    "title_uz": "Samsung magnitli davrga kirmoqda: Galaxy S26 seriyali smartfonlar keng qamrovli aksessuarlar, jumladan zaryadlovchilar, korpuslar va hatto tashqi batareyani oladi.",
    "desc_uz": "Samsung magnitli davrga kirmoqda: Galaxy S26 seriyali smartfonlar keng qamrovli aksessuarlar, jumladan zaryadlovchilar, korpuslar va hatto tashqi batareyani oladi.",
    "full_text_uz": "Internetda Samsung kompaniyasi Galaxy S26 seriyali smartfonlar uchun yaratayotgan yangi magnit aksessuarlar haqida ko‘proq ma’lumotlar paydo bo‘lishda davom etmoqda.\n\nBiz allaqachon 25 Vt quvvatga ega smartfonlarni simsiz zaryadlash uchun yangi qurilma haqida sizib chiqishga e'tibor qaratgan edik va endi koreys ishlab chiqaruvchisi yana bir nechta kutilmagan hodisalar tayyorlayotganini ta'kidlaymiz - bu Roland Quandt insayderining materialidan ma'lum bo'ldi.\n\nYuqorida aytib o'tilgan zaryadlashdan tashqari, Galaxy S26 liniyasi uchun Qi2 standartlaridan jiddiy foydalanadigan yangi aksessuarlar ekotizimiga Magnetic Clear, Magnetic Carbon, Magnetic Rugged va Magnetic Silicon korpuslari kiradi - barchasi mos keluvchi qurilmalarni himoya qilish uchun o'rnatilgan magnitlarga ega.\n\nKompaniya, shuningdek, Wireless Power Consortium ma'lumotlar bazasida allaqachon paydo bo'lgan yangi magnit tashqi batareyani ishlab chiqmoqda.\n\nAlohida, Galaxy S26 Ultra uchun yana bir aksessuar chiqariladi - ikkita magnitli ushlagich, Bluetooth S Pen stilusli modellar uchun mo'ljallangan.",
    "title_en": "Samsung входит в магнитную эру: смартфоны серии Galaxy S26 получат обширный набор аксессуаров, среди которых зарядки, чехлы и даже внешний аккумулятор",
    "desc_en": "Samsung входит в магнитную эру: смартфоны серии Galaxy S26 получат обширный набор аксессуаров, среди которых зарядки, чехлы и даже внешний аккумулятор",
    "full_text_en": "В сети продолжает появляться все больше информации о новых магнитных аксессуарах, которые Samsung разрабатывает для смартфонов серии Galaxy S26.\n\nМы уже обращали внимание на утечку о новом устройстве для беспроводной зарядки смартфонов мощностью 25 Вт, а теперь акцентируем внимание, что корейский производитель готовит еще несколько сюрпризов - об этом стало известно из материала инсайдера Roland Quandt.\n\nВ дополнении к упомянутой выше зарядке, новая экосистема аксессуаров для линейки Galaxy S26, которая будет активно использовать стандарты Qi2, включает чехлы Magnetic Clear, Magnetic Carbon, Magnetic Rugged и Magnetic Silicon — все со встроенными магнитами для фиксации совместимых устройств.\n\nТакже компания разрабатывает новый магнитный внешний аккумулятор, который уже замечен в базе Wireless Power Consortium.\n\nОтдельно для Galaxy S26 Ultra выйдет еще один аксессуар — держатель с двумя магнитами, рассчитанный на модели с Bluetooth-стилусом S Pen.",
    "image": "https://gagadget.com/media/cache/f7/17/f71785018cebc37969c91d7a18dcb573.webp",
    "article_images": [
      "https://gagadget.com/media/cache/fa/9a/fa9a126cfc3d36b7db18af5c10941ec6.webp"
    ],
    "category": "Samsung",
    "link": "https://gagadget.com/ru/687485-samsung-vhodit-v-magnitnuyu-eru-smartfonyi-serii-galaxy-s26-poluchat-obshirnyij-nabor-aksessuarov-sredi-kotoryih-zaryadki-chehlyi-i-dazhe-vneshnij-akkumulyator/",
    "time": "11 декабря 2025, 14:32",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:48.825880"
  },
  {
    "id": 3029620831939218192,
    "title_uz": "Dekabr oyi oxiriga kelib, yangi Honor Win seriyasining ulkan batareyali flagman smartfonlari chiqarilishi mumkin",
    "desc_uz": "Dekabr oyi oxiriga kelib, yangi Honor Win seriyasining ulkan batareyali flagman smartfonlari chiqarilishi mumkin",
    "full_text_uz": "Xitoyning Honor brendi dekabr oyi oxirigacha sotuvga chiqishi mumkin bo‘lgan Win nomli yangi smartfonlar seriyasini taqdim etishga hozirlik ko‘rmoqda.\n\nXitoyning mashhur JD bozorida Honor Win qurilmalari sahifalari “super samarali flagman modellari” yorlig‘i bilan paydo bo‘ldi.\n\nNufuzli insayder Repeater 002 xabar berishicha, Win seriyasi GT2 o'rnini egallaydi.\n\nMa'lumki, xaridorlarga ikkita Honor Win modeli taklif etiladi: asosiysi oldingi avlod Snapdragon 8 Elite chipsetini oladi va eskisi yuqori darajadagi Snapdragon 8 Elite Gen 5 protsessoriga ega. AAK-AN00 va AAP-AN00 kodlari ostidagi ikkala smartfon ham 100 Vt quvvatga ega zaryadlovchi qurilmasi bilan birga 3C sertifikatidan o‘tdi.\n\nInsayder maʼlumotlariga koʻra, Honor Win 1,5K oʻlchamli katta tekis displeyga, bardoshli metall korpusga va ilgʻor namlikdan himoyalanishga ega boʻladi. Asosiy kamerada 50 MP sensor mavjud.\n\nHonor Win’ning asosiy xususiyati uning uzoq vaqtdan beri mish-mishlar yurgan ulkan kuchli batareyalari bo‘ladi. Hozircha 8500 mA/soat esga olinadi, biroq ayrim prototiplar 10 000 mA/soat quvvatga ega sinovdan o‘tkazilmoqda.\n\nHonor Win smartfonlarining Xitoy bozoridan tashqarida chiqarilishi hozircha noma'lum.",
    "title_en": "До конца декабря могут выйти флагманские смартфоны новой серии Honor Win с аккумуляторами огромной емкости",
    "desc_en": "До конца декабря могут выйти флагманские смартфоны новой серии Honor Win с аккумуляторами огромной емкости",
    "full_text_en": "Китайский бренд Honor готовится к запуску новой серии смартфонов под названием Win, которая может поступить в продажу до конца декабря.\n\nНа популярном китайском маркетплейсе JD появились страницы устройств Honor Win с пометкой “суперпроизводительные флагманские модели”.\n\nАвторитетный инсайдер Repeater 002 сообщил, что серия Win заменит GT2.\n\nИзвестно, что покупателям предложат две модели Honor Win: базовую, которая получит чипсет Snapdragon 8 Elite прошлого поколения, и старшую с топовым процессором Snapdragon 8 Elite Gen 5. Оба смартфона под кодами AAK-AN00 и AAP-AN00 прошли сертификацию 3C вместе с зарядным устройством мощностью 100 Вт.\n\nПо инсайдерской информации, Honor Win получат большой плоский дисплей с разрешением 1,5K, прочный металлический корпус и продвинутую влагозащиту. Основная камера имеет сенсор на 50 Мп.\n\nГлавной особенностью Honor Win станут аккумуляторы огромной мощности, о которых давно ходят слухи. Пока упоминается 8500 мА·ч, однако некоторые прототипы тестируются с емкостью и в 10 000 мАч.\n\nПока неизвестно, выйдут ли смартфоны Honor Win за пределами китайского рынка.",
    "image": "https://gagadget.com/media/cache/d2/b1/d2b1868d1ca0519c1f6083c334b260b7.webp",
    "article_images": [
      "https://gagadget.com/media/cache/59/87/598799c4a197fb64b7947d99f54cf3fa.webp",
      "https://gagadget.com/media/uploads/image-76.jpg"
    ],
    "category": "Boshqa",
    "link": "https://gagadget.com/ru/687471-do-kontsa-dekabrya-mogut-vyijti-flagmanskie-smartfonyi-novoj-serii-honor-win-s-akkumulyatorami-ogromnoj-emkosti/",
    "time": "11 декабря 2025, 13:42",
    "hours_ago": 0,
    "is_new": true,
    "timestamp": "2025-12-19T17:06:53.785731"
  }
]